<!-- dflook/terraform-github-actions {"workspace":"dev-dev-deploy","backend_type":"remote","backend":"0dd52039d936a7e1d5025a8a4d08a2edb19c1f8a40406c06dd09dde4084f97a6","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #57 at https://github.com/scidsg/hushline/actions/runs/9724595656","plan_out_hash":"f63341b32e056064d8b7be3a707ef1b7d81910483cf783bfe0302c3c2ad8cd6c","plan_hash":"a90e2bd1d56a03d33755376e52d5927355ab470f1d0e4e94bc57d0f6e9f3c586","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __dev-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
branch = "dev-deploy"
name   = "hushline-dev-deploy"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_app.app must be replaced
-/+ resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
!~      created_at           = "2024-06-29 13:28:04 +0000 UTC" -> (known after apply)
+       default_ingress      = (known after apply)
!~      id                   = "************************************" -> (known after apply)
+       live_url             = (known after apply)
!~      updated_at           = "2024-06-29 13:33:38 +0000 UTC" -> (known after apply)
!~      urn                  = "do:app:ee782276-ec86-42fb-85a6-c1d7f898de92" -> (known after apply)
#        (1 unchanged attribute hidden)

!~      dedicated_ips {
+           active_deployment_id = (known after apply)
+           created_at           = (known after apply)
+           default_ingress      = (known after apply)
+           id                   = (known after apply)
+           live_url             = (known after apply)
+           project_id           = (known after apply)
+           updated_at           = (known after apply)
+           urn                  = (known after apply)
        } -> (known after apply)

!~      spec {
!~          domains  = [] -> (known after apply)
-           features = [
-               "buildpack-stack=ubuntu-22",
            ] -> null
            name     = "hushline-dev-deploy"
#            (1 unchanged attribute hidden)

!~          domain {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          ingress {
+               domains  = (known after apply)
+               features = (known after apply)
+               name     = (known after apply)
+               region   = (known after apply)
            } -> (known after apply)

!~          service {
+               dockerfile_path    = "Dockerfile"
!~              internal_ports     = [] -> (known after apply)
                name               = "hushline"
+               run_command        = (known after apply)
#                (6 unchanged attributes hidden)

!~              health_check {
-                   failure_threshold     = 0 -> null
-                   initial_delay_seconds = 0 -> null
-                   period_seconds        = 0 -> null
-                   port                  = 0 -> null
-                   success_threshold     = 0 -> null
-                   timeout_seconds       = 0 -> null
#                    (1 unchanged attribute hidden)
                }

!~              routes {
+                   build_command      = (known after apply)
+                   dockerfile_path    = (known after apply)
+                   environment_slug   = (known after apply)
+                   http_port          = (known after apply)
+                   instance_count     = (known after apply)
+                   instance_size_slug = (known after apply)
+                   internal_ports     = (known after apply)
+                   name               = (known after apply)
+                   run_command        = (known after apply)
+                   source_dir         = (known after apply)
                } -> (known after apply)

#                (1 unchanged block hidden)
            }

#            (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #57](https://github.com/scidsg/hushline/actions/runs/9724595656)